In [30]:
from load_data.data_loader import load_hotel_reserve
customer_tb, hotel_tb, reserve_tb = load_hotel_reserve()

In [31]:
customer_tb.iloc[0:5, :]

  customer_id  age    sex  home_latitude  home_longitude
0         c_1   41    man      35.092193      136.512347
1         c_2   38    man      35.325076      139.410551
2         c_3   49  woman      35.120543      136.511179
3         c_4   43    man      43.034868      141.240314
4         c_5   31    man      35.102661      136.523797

In [32]:
customer_tb.loc[0:5, ['sex', 'age']]

     sex  age
0    man   41
1    man   38
2  woman   49
3    man   43
4    man   31
5    man   52

In [33]:
customer_tb = customer_tb.drop(['customer_id'], axis=1)

In [34]:
customer_tb.head()

   age    sex  home_latitude  home_longitude
0   41    man      35.092193      136.512347
1   38    man      35.325076      139.410551
2   49  woman      35.120543      136.511179
3   43    man      43.034868      141.240314
4   31    man      35.102661      136.523797